In [1]:
import numpy as np
import pandas as pd

In [7]:
# Seed=42
rng = np.random.RandomState(42)

In [8]:
# Create random number list range from 0-10 and N=4
ser = pd.Series(rng.randint(0,10,4))

In [9]:
ser

0    6
1    3
2    7
3    4
dtype: int64

In [17]:
df = pd.DataFrame(rng.randint(0,10,(3,4) # (3,4) is shape, 0-10 range
                             ),
                 columns=['A','B','C','D'])
df

   A  B  C  D
0  6  3  8  2
1  4  2  6  4
2  8  6  1  3

In [18]:
df

   A  B  C  D
0  6  3  8  2
1  4  2  6  4
2  8  6  1  3

#### If we apply a NumPy ufunc on either of these objects, the result will be another Pandas object with the indices preserved:

In [21]:
#Take exponet
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [22]:
np.sin(df * np.pi /4)

              A         B             C             D
0 -1.000000e+00  0.707107 -2.449294e-16  1.000000e+00
1  1.224647e-16  1.000000 -1.000000e+00  1.224647e-16
2 -2.449294e-16 -1.000000  7.071068e-01  7.071068e-01

### UFuncs: Index Alignment

In [23]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                         'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [24]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

##### The resulting array contains the union of indices of the two input arrays, which we could determine using standard Python set arithmetic on these indices:

In [25]:
area.index | population.index

Index([u'Alaska', u'California', u'New York', u'Texas'], dtype='object')

Addition on two different dataframes having the almost similar indexes

In [26]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])

##### answer will be the union of index

In [27]:
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

#### if 'NaN' is undesirable in DF the we can use the function .add and provice argument fill_value=INT

In [28]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### INDEX ALIGNMENT IN DATAFRAME

In [29]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)), columns=list('AB'))

In [30]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))

In [31]:
A + B

      A     B   C
0  19.0  20.0 NaN
1   8.0   3.0 NaN
2   NaN   NaN NaN

#####  Here weâ€™ll fill with the mean of all values in A (which we compute by first stacking the rows of A):

In [35]:
A

    A   B
0  13  17
1   8   1

In [36]:
# Stack values of both columns onto one column

In [37]:
A.stack()

0  A    13
   B    17
1  A     8
   B     1
dtype: int64

In [38]:
A.stack().mean()

9.75

## Ufuncs: Operations Between DataFrame and Series

In [40]:
# Create Series/Array
A = rng.randint(10, size=(3, 4))

In [41]:
A

array([[6, 8, 7, 4],
       [1, 4, 7, 9],
       [8, 8, 0, 8]])

In [43]:
A-A[1,0]

array([[ 5,  7,  6,  3],
       [ 0,  3,  6,  8],
       [ 7,  7, -1,  7]])

#### create column name from the list

In [45]:
df = pd.DataFrame(A, columns=list('QRST'))

In [46]:
df

   Q  R  S  T
0  6  8  7  4
1  1  4  7  9
2  8  8  0  8

In [47]:
df.iloc[0]

Q    6
R    8
S    7
T    4
Name: 0, dtype: int64

### AXIS

In [48]:
df

   Q  R  S  T
0  6  8  7  4
1  1  4  7  9
2  8  8  0  8

In [50]:
# means subtract with R column on 0 axis
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -2  0 -1 -4
1 -3  0  3  5
2  0  0 -8  0

In [54]:
df.subtract(df['R'], axis=1)

    0   1   2   Q   R   S   T
0 NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN

#### halfrow

In [59]:
halfrow = df.iloc[0, ::2]

In [60]:
halfrow

Q    6
S    7
Name: 0, dtype: int64

In [61]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -5.0 NaN  0.0 NaN
2  2.0 NaN -7.0 NaN